
class Post {
  final String title;
  final String author;
  final String imageUrl;
  final String description;
  bool selected = false;

  Post({required this.title, required this.author, required this.imageUrl , required this.description});
}

final List<Post> posts = [
  Post(
    title: "title11", 
    author: "author11", 
    imageUrl: "https://pic.rmb.bdstatic.com/bjh/news/0fc6b71c59a69f39cf2e1244d10eaedc.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title222", 
    author: "author22", 
    imageUrl: "https://img1.baidu.com/it/u=1368815763,3761060632&fm=253&fmt=auto&app=138&f=JPEG?w=760&h=434",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title3333", 
    author: "author33", 
    imageUrl: "https://i-blog.csdnimg.cn/blog_migrate/41635df939e6dd13c6d5e2af785d358b.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title1111", 
    author: "author11", 
    imageUrl: "https://pic.rmb.bdstatic.com/bjh/news/0fc6b71c59a69f39cf2e1244d10eaedc.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title222", 
    author: "author22", 
    imageUrl: "https://img1.baidu.com/it/u=1368815763,3761060632&fm=253&fmt=auto&app=138&f=JPEG?w=760&h=434",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title33333", 
    author: "author33", 
    imageUrl: "https://i-blog.csdnimg.cn/blog_migrate/41635df939e6dd13c6d5e2af785d358b.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title111111", 
    author: "author11", 
    imageUrl: "https://pic.rmb.bdstatic.com/bjh/news/0fc6b71c59a69f39cf2e1244d10eaedc.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title22222222", 
    author: "author22", 
    imageUrl: "https://img1.baidu.com/it/u=1368815763,3761060632&fm=253&fmt=auto&app=138&f=JPEG?w=760&h=434",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title333333", 
    author: "author33", 
    imageUrl: "https://i-blog.csdnimg.cn/blog_migrate/41635df939e6dd13c6d5e2af785d358b.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title11", 
    author: "author11", 
    imageUrl: "https://pic.rmb.bdstatic.com/bjh/news/0fc6b71c59a69f39cf2e1244d10eaedc.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title22", 
    author: "author22", 
    imageUrl: "https://img1.baidu.com/it/u=1368815763,3761060632&fm=253&fmt=auto&app=138&f=JPEG?w=760&h=434",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
  Post(
    title: "title33", 
    author: "author33", 
    imageUrl: "https://i-blog.csdnimg.cn/blog_migrate/41635df939e6dd13c6d5e2af785d358b.jpeg",
    description: "《易水歌》是战国时期刺客荆轲赴秦刺杀秦王时在易水与燕太子丹等人饯别之际所唱的歌辞。歌辞前句通过描写秋风萧瑟，易水寒冽，极天地愁惨之状，渲染了苍凉悲壮的肃杀气氛，渗透出歌者激越澎湃的感情；后句表现主人公大义凛然、义无反顾、抱定必死决心深入虎穴的献身精神。全辞语言平易简练，借景抒情，情景交融，通过对风声萧萧、易水寒凉的外界景物的渲染烘托，表现了荆轲去刺杀秦王时的悲壮情怀和不完成任务誓不回还的坚定意志。"
  ),
];